Autodesk.Revit.DB.DirectContext3D.VertexStream.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectContext3D.VertexStream
The base class for DirectContext3D vertex streams, which are used to write vertex data into buffers.
Remarks:
This base class cannot be used directly.  Instead, a steam that is specific for each type of
vertex must be used.
Use Autodesk.Revit.DB.DirectContext3D.VertexStreamPosition to insert Autodesk.Revit.DB.DirectContext3D.VertexPosition instances.Use Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionColored to insert Autodesk.Revit.DB.DirectContext3D.VertexPositionColored instances.Use Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormal to insert Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal instances.Use Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored to insert Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored instances.
The process of putting vertex data into a buffer involves using a stream-buffer pair as follows:
Map the vertex buffer.Get a stream of the appropriate type from the buffer.Add vertices of the same type to the stream. They will be written into the buffer that was used to create the stream.Unmap the buffer.
As an alternative to using streams, it is possible to write data into a buffer using a handle to its mapped memory.
Since:
2017